In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
print(os.listdir("C:\Users\JaiminPat\Downloads\KaggleCoursera"))

['.ipynb_checkpoints', 'items.csv', 'item_categories.csv', 'KaggleCoursera.ipynb', 'sales_train.csv_2.gz', 'sample_submission.csv.gz', 'shops.csv', 'test.csv.gz']

In [9]:

items_df = pd.read_csv('C:\Users\JaiminPat\Downloads\KaggleCoursera\items.csv')
shops_df = pd.read_csv('C:\Users\JaiminPat\Downloads\KaggleCoursera\shops.csv')

icats_df = pd.read_csv('C:\Users\JaiminPat\Downloads\KaggleCoursera\item_categories.csv')
train_df = pd.read_csv('C:\Users\JaiminPat\Downloads\KaggleCoursera\sales_train.csv_2.gz', compression='gzip', header=0, sep=',', quotechar='"')
smpsb_df = pd.read_csv('C:\Users\JaiminPat\Downloads\KaggleCoursera\sample_submission.csv.gz', compression='gzip', header=0, sep=',', quotechar='"')
test_df  = pd.read_csv('C:\\Users\\JaiminPat\\Downloads\\KaggleCoursera\\test.csv')
# Any results you write to the current directory are saved as output.

In [12]:
train_df.shape

(2935849, 6)

In [17]:
smpsb_df.head()

   ID  item_cnt_month
0   0             0.5
1   1             0.5
2   2             0.5
3   3             0.5
4   4             0.5

In [14]:
train_df.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [18]:
test_df.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [21]:
agr = {
    'item_cnt_day': {
         'tot_cnt' : 'sum'                         
    }
}
grp_by = train_df.groupby(['shop_id', 'item_id']).agg(agr).reset_index()
grp_by.head()

  shop_id item_id item_cnt_day
                       tot_cnt
0       0      30         31.0
1       0      31         11.0
2       0      32         16.0
3       0      33          6.0
4       0      35         15.0

In [22]:
train_df['shop_id'].nunique()

60

In [23]:
train_df['item_id'].nunique()

21807

In [25]:
items_df['item_id'].nunique()

22170

In [27]:
test_df['item_id'].nunique()

5100

In [46]:
not_in_train_items = test_df[~test_df['item_id'].isin(train_df['item_id'])]['item_id']

In [48]:
items_df[items_df.item_id.isin(np.array(not_in_train_items))].head()

,item_name,item_id,item_category_id
83,12/ДВЕНАДЦАТЬ (СР) (Регион),83,40
140,1С:Аудиокниги. Аладдин и другие восточные сказ...,140,45
168,1С:Аудиокниги. Аудиокурсы по географии. 6 клас...,168,44
173,1С:Аудиокниги. Аудиоэнциклопедия для самых мал...,173,45
204,"1С:Аудиокниги. Г.Р. Хаггард. Клеопатра [PC, Ци...",204,44

In [55]:
train = train_df
test = test_df
#train_df[train_df['shop_id'].isin(test_df['shop_id'])]

In [56]:
train['shop_item'] = train['shop_id'].map(str) + '_' + train['item_id'].map(str)
test['shop_item'] = test['shop_id'].map(str) + '_' + test['item_id'].map(str)

In [59]:
test_in_train = train[train['shop_item'].isin(test['shop_item'])]

In [61]:
test_in_train.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,shop_item
0,02.01.2013,0,59,22154,999.0,1.0,59_22154
10,03.01.2013,0,25,2574,399.0,2.0,25_2574
11,05.01.2013,0,25,2574,399.0,1.0,25_2574
12,07.01.2013,0,25,2574,399.0,1.0,25_2574
13,08.01.2013,0,25,2574,399.0,2.0,25_2574

In [64]:
agrr = {
    'item_cnt_day' : {
        'tot_items' : 'sum'
    }
}
tit = test_in_train.groupby('shop_item').agg(agrr).reset_index()

In [67]:
tit[tit.shop_item == '25_2574']

      shop_item item_cnt_day
                   tot_items
30005   25_2574        242.0

In [68]:
tit.shape

(111404, 2)

In [73]:
test[test.shop_item == '10_10003']

          ID  shop_id  item_id shop_item
33050  33050       10    10003  10_10003

In [71]:
test.shop_item.nunique()

214200

In [74]:
tit.head()

  shop_item item_cnt_day
               tot_items
0  10_10003          1.0
1  10_10007          2.0
2  10_10029          1.0
3  10_10039          4.0
4  10_10042          3.0

In [76]:
test.head()

   ID  shop_id  item_id shop_item
0   0        5     5037    5_5037
1   1        5     5320    5_5320
2   2        5     5233    5_5233
3   3        5     5232    5_5232
4   4        5     5268    5_5268

In [77]:
tit.shop_item.nunique()

111404

In [89]:
test_tit_join = pd.concat([test.set_index('shop_item'), tit.set_index('shop_item')], axis=1, join='outer').reset_index()

In [81]:
train[train.shop_item == '10_10005']

Empty DataFrame
Columns: [date, date_block_num, shop_id, item_id, item_price, item_cnt_day, shop_item]
Index: []

In [82]:
train.shape

(2935849, 7)

In [83]:
train.shop_item.nunique()

424124

In [85]:
agre = {
    'item_cnt_day': {
        'tot' : 'sum'
    }
}
train_mean_item_cnt_shop_item = train.groupby('shop_item').agg(agre).reset_index()
#train.groupby('shop_item').agg(agre).reset_index()

In [88]:
train_mean_item_cnt_shop_item.item_cnt_day.tot.mean()

8.60174382963473

In [93]:
test_tit_join.head()

      index     ID  shop_id  item_id  (item_cnt_day, tot_items)
0  10_10003  33050       10    10003                        1.0
1  10_10005  32455       10    10005                        NaN
2  10_10007  35412       10    10007                        2.0
3  10_10021  32228       10    10021                        NaN
4  10_10027  35385       10    10027                        NaN

In [97]:
test.head()

   ID  shop_id  item_id shop_item
0   0        5     5037    5_5037
1   1        5     5320    5_5320
2   2        5     5233    5_5233
3   3        5     5232    5_5232
4   4        5     5268    5_5268

In [126]:
sub = pd.concat([test.set_index('shop_item'), test_tit_join.set_index('index')], axis=1, join='inner').reset_index()

In [128]:
arr = np.array(sub)

In [129]:
sub.shape

(214200, 8)

In [130]:
sub['pred'] = arr[:,7]

In [132]:
mean = train_mean_item_cnt_shop_item.item_cnt_day.tot.mean()
sub.loc[sub.pred.isnull(), 'pred'] = mean

In [139]:
sub_final_arr = np.array(sub)

In [144]:
sub_final = pd.dataframe(sub_final_arr[:,1], columns = list('ID'))

AttributeError: 'module' object has no attribute 'dataframe'

In [141]:
sub.head()

,index,ID,shop_id,item_id,ID,shop_id,item_id,"(item_cnt_day, tot_items)",pred
0,5_5037,0,5,5037,0,5,5037,13.0,13
1,5_5320,1,5,5320,1,5,5320,NaN,8.60174
2,5_5233,2,5,5233,2,5,5233,10.0,10
3,5_5232,3,5,5232,3,5,5232,1.0,1
4,5_5268,4,5,5268,4,5,5268,NaN,8.60174